# HLength

## Description
Function HLength returns the length of a line.

```pascal
FUNCTION HLength(h : HANDLE): REAL;
```

```python
def vs.HLength(h):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Version
Availability: from All Versions

## Category
* Object Info